def main_ligquistic_pipeline():
    # TODO
    # () преобразован текст в канонический Markdown
    # () текст проверен на грамматические ошибки
    # () преобразован канонический Markdown в онтологию
    # () ИЛИ
    #     - Простой вариант
    #         - () преобразован текст напрямую в карту знаний
    #     - Полноценный вариант
    #         - () проанализирован корпус текстов
    #         - () найдены лингвистические закономерности
    #         - () преобразованы лингвистические закономерности в онтологию
    #         - () преобразована онтология в карту знаний 
    # ()
    # ()
    # ()
    # ()
    # ()
    # ()
    # ()
    # ()
    # ()
    pass