# Пример карты знаний для первого предложения
#
# Блоки
# 1. Дофамин открыт как нейромедиатор в 1950-ых
# 2. Проведены исследования болезни Паркинсона
# 3. Сформирована богатая база знаний о болезни Паркинсона
# 4. Сформирована сложная база знаний о болезни Паркинсона
# 5. Выявлено что болезнь Паркинсона являетя возрастной многофакторной
# 6. Выявлено что генетические факторы повлияли на болезнь Паркинсона
# 7. Выявлено что факторы окружающей среды повлияли на болезнь Паркинсона
# 8. Болезнь Паркинсона является возрастной многофакторной
# 9. Генетические факторы повлияли на болезнь Паркинсона
# 10. Факторы окружающей среды повлияли на болезнь Паркинсона
# 
# Связи 
# 1 → 2
# 2 → 3
# 2 → 4
# 3 → 5
# 3 → 6
# 3 → 7
# 4 → 5
# 4 → 6
# 4 → 7
# 8 → 5
# 9 → 6
# 10 → 7